namespace TestExtention
{
    public enum AtolModels
    {
        ЭЛВЕС_МИКРО_Ф = 0,

        Триум_Ф = 13,

        Феликс_Р_Ф = 14,

        Феликс_02K = 15,

        Меркурий_140Ф = 16,

        Меркурий_114 = 17,

        Штрих_ФР_Ф = 18,

        Элвес_Мини_ФР_Ф = 19,

        Торнадо_Ф = 20,

        Торнадо_К = 23,

        Феликс_РК = 24,

        Штрих_ФР_К = 25,

        Элвес_ФР_К = 26,

        Феликс_3СК = 27,

        Штрих_Мини_ФР_К = 28,

        FPrint_02K = 30,

        Fprint_03K = 31,

        Fprint_88K = 32,

        Bixolon_01K = 33,

        FPrint_5200K = 35,

        PayVKP_80K = 41,

        Аура_01ФРKZ = 42,

        PayVKP_80KZ = 43,

        PayPPU_700K = 45,

        PayCTS_2000K = 46,

        FPrint_55_ПТК = 47,

        Wincor_Nixdorf_TH230K = 50,

        FPrint_11K_ПТК = 51,

        FPrint_22K = 52,

        FPrint_77ПТК = 53,

        FPrintPay_01ПТК = 54,

        Атол_25Ф = 57,

        Атол_30Ф = 61,

        Атол_55Ф = 62,

        Атол_22Ф_FPrint22_ПТК = 63,

        Атол_52Ф = 64,

        Атол_11Ф = 67,

        Атол_77Ф = 69,

        Атол_90Ф = 72,

        Эвотор_СТ2Ф = 74,

        Атол_60Ф = 75,

        Казначей_ФА = 76,

        Атол_42ФС = 77,

        Атол_15Ф = 78,

        POSPrint_FP410K = 101,

        MSTAR_Ф_3 = 102,

        Мария_301_MTM = 103,

        ПРИМ_88TK = 105,

        СП101ФР_К = 106,

        ШТРИХ_КОМБО_ФР_К = 107,

        ПРИМ_07К = 108,

        МИНИ_ФП6 = 109,

        ШТРИХ_М_ФР_К = 110,

        MSTAR_TK_1 = 111,

        ШТРИХ_LIGHT_ФР_К = 113,

        ПИРИТ_ФР01К = 114,

        NCR_001K = 115,

        IKC_E260T = 116,

        ПОРТ_FP_300 = 117,

        ШТРИХ_ФР_Ф = 118,

        FP3530T = 119,

        ПОРТ_FP_60 = 120,

        Мебиус_3К = 121,

        Spark_801T = 123,

        ШТРИХ_ФР_К_KZ = 125,

        ШТРИХ_М_ПТК_RR_01K_02K_04K = 126,

        ШТРИХ_М_ПТК_Retail_01K = 127,

        КРИСТАЛ_СЕРВИС_PrintK = 128,

        ШТРИХ_54_ФЗ = 254,
    }
}